In [2]:
import pandas as pd
import numpy as np

In [3]:
print("test")

test

In [4]:
data2 = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 35],
    'Salary': [50000, 60000, 45000, 70000],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}

In [5]:
df = pd.DataFrame(data2)

In [6]:
df

      Name  Age  Salary           City
0    Alice   25   50000       New York
1      Bob   30   60000  San Francisco
2  Charlie   22   45000    Los Angeles
3    David   35   70000        Chicago

In [7]:
filtered_data = df[df['Age'] > 25]
filtered_data

    Name  Age  Salary           City
1    Bob   30   60000  San Francisco
3  David   35   70000        Chicago

In [8]:
sorted_data = df.sort_values(by='Salary', ascending=False)
print(sorted_data)

      Name  Age  Salary           City
3    David   35   70000        Chicago
1      Bob   30   60000  San Francisco
0    Alice   25   50000       New York
2  Charlie   22   45000    Los Angeles

In [10]:
avg_salary_by_city = df.groupby('City')['Salary'].mean()
avg_salary_by_city

City
Chicago          70000.0
Los Angeles      45000.0
New York         50000.0
San Francisco    60000.0
Name: Salary, dtype: float64